docs/source/_posts/note/math/constructivism/learning-constructivism.org
#+title:  learning constructivism

* history of constructivism in the 20th century [troelstra]

*** introduction

    - constructivism may be regarded as a reaction
      to the rapidly increasing use
      of highly abstract concepts and methods
      of proof in mathematics
      a trend exemplified by the works of dedekind and cantor

    - 在仔細瞭解構造主義的論點之前
      我覺得 kronecker 對 cantor 的態度是反動的
      但是其實不然

    - notation
      |-----+-------------------------------------------------------|
      | IPC | intuitionistic propositional logic                    |
      | IQC | intuitionistic predicate logic                        |
      | HA  | intuitionistic arithmetic                             |
      |-----+-------------------------------------------------------|
      | PEM | principle of excluded middle -- ((not A) or A)        |
      |     | principle of double negation -- ((not (not A)) --> A) |
      |-----+-------------------------------------------------------|

*** finitism

***** finitist mathematics

      - 存在 x 滿足 A(x)
        爲了使用我的語法必須給 x 以類型
        因爲要以基礎數論爲例子來檢驗語法的實用性
        所以以 <number> 爲類型的例子
        而得到
        (-> x : <number> (A :x:))
      - 否定 任意 x 滿足 A(x)
        首先
        任意 x 滿足 A(x)
        爲
        (x : <number> -> (A :x:))
        否定就是
        ((A :x:) -> x : <number>)
        這顯然也是
        存在 x 滿足 否定 A(x)
        注意對 x 的處理方式是模式匹配
        所以
        x : <number>
        的語義其實也是一個匹配 它可以出現在 (A :x:) 之後
      - 這裏
        某些術語縮寫 不經解釋
        並且某些術語定義也被省略了

***** actualism

*** predicativism and semi-intuitionism

***** poincare

***** the semi-intuitionists

***** borel and the continuum

***** weyl

***** predicativism after 'das Kontinuum'

*** brouwerian intuitionism

***** early period

***** weak counterexamples and the creative subject

***** brouwer's programme

*** intuitionistic logic and arithmetic

***** L.E.J. brouwer and intuitionistic logic

***** the brouwer-heyting-kolmogorov interpretation

***** formal intuitionistic logic and arithmetic till 1940

***** metamathematics of intuitionistic logic and arithmetic after 1940

***** formulas-as-types

*** intuitionistic analysis and stronger theories

***** choice sequences in brouwer's writings

***** axiomatization of intuitionistic analysis

***** the model theory of intuitionistic analysis

*** constructive recursive mathematics

***** classical recursive mathematics

***** constructive recursive mathematics

*** bishop's constructivism

***** bishop's constructive mathematics

***** the relation of BCM to INT and CRM

*** concluding remarks
