out/note/mathematics/constructivism/learning-constructivism.org.html
<!DOCTYPE html>
<html>
<head>
<meta charset="UTF-8">
<title>note/mathematics/constructivism/learning-constructivism.org</title>
</head>
<body>
<pre>#+title:  learning constructivism

* history of constructivism in the 20th century [troelstra]

*** introduction

    - constructivism may be regarded as a reaction
      to the rapidly increasing use
      of highly abstract concepts and methods
      of proof in mathematics
      a trend exemplified by the works of dedekind and cantor

    - 在仔細瞭解構造主義的論點之前
      我覺得 kronecker 對 cantor 的態度是反動的
      但是其實不然

    - notation
      |-----+-------------------------------------------------------|
      | IPC | intuitionistic propositional logic                    |
      | IQC | intuitionistic predicate logic                        |
      | HA  | intuitionistic arithmetic                             |
      |-----+-------------------------------------------------------|
      | PEM | principle of excluded middle -- ((not A) or A)        |
      |     | principle of double negation -- ((not (not A)) --&gt; A) |
      |-----+-------------------------------------------------------|

*** finitism

***** finitist mathematics

      - 存在 x 滿足 A(x)
        爲了使用我的語法必須給 x 以類型
        因爲要以基礎數論爲例子來檢驗語法的實用性
        所以以 &lt;number&gt; 爲類型的例子
        而得到
        (-&gt; x : &lt;number&gt; (A :x:))
      - 否定 任意 x 滿足 A(x)
        首先
        任意 x 滿足 A(x)
        爲
        (x : &lt;number&gt; -&gt; (A :x:))
        否定就是
        ((A :x:) -&gt; x : &lt;number&gt;)
        這顯然也是
        存在 x 滿足 否定 A(x)
        注意對 x 的處理方式是模式匹配
        所以
        x : &lt;number&gt;
        的語義其實也是一個匹配 它可以出現在 (A :x:) 之後
      - 這裏
        某些術語縮寫 不經解釋
        並且某些術語定義也被省略了

***** actualism

*** predicativism and semi-intuitionism

***** poincare

***** the semi-intuitionists

***** borel and the continuum

***** weyl

***** predicativism after &apos;das Kontinuum&apos;

*** brouwerian intuitionism

***** early period

***** weak counterexamples and the creative subject

***** brouwer&apos;s programme

*** intuitionistic logic and arithmetic

***** L.E.J. brouwer and intuitionistic logic

***** the brouwer-heyting-kolmogorov interpretation

***** formal intuitionistic logic and arithmetic till 1940

***** metamathematics of intuitionistic logic and arithmetic after 1940

***** formulas-as-types

*** intuitionistic analysis and stronger theories

***** choice sequences in brouwer&apos;s writings

***** axiomatization of intuitionistic analysis

***** the model theory of intuitionistic analysis

*** constructive recursive mathematics

***** classical recursive mathematics

***** constructive recursive mathematics

*** bishop&apos;s constructivism

***** bishop&apos;s constructive mathematics

***** the relation of BCM to INT and CRM

*** concluding remarks
</pre>
</body>
</html>
